'use strict';

const TelegramBot = require('node-telegram-bot-api'),
      token       = '580283341:AAF-96aQyKJ9Cp774L1GIucd6OhMAbf89ak',
      bot         = new TelegramBot(token, {polling: true});


bot.on('message', function (msg)
    {
        const id           = msg.from.id,
              _messageText = msg.text,
              messageText  = _messageText.toLocaleLowerCase();


        if (messageText === "серед моря один" || messageText === "серед моря" || messageText === "коля олех" || messageText === "philadelphia")
        {
            bot.sendMessage(id, 'Вступ: D - F#m7/C# - G7 /H - A\n' +
                'D F#m7/C# \n' +
                'Серед моря один,\n' +
                '\n' +
                'Hm A \n' +
                'Буря човен перевертає\n' +
                'D F#m7/C#\n' +
                '\n' +
                'Втриматись нема сил,\n' +
                '\n' +
                'Hm A \n' +
                'Ця стихія життя поглинає…\n' +
                '\n' +
                'Hm F#m/A\n' +
                'З останніх сил,\n' +
                '\n' +
                'А G Hm\n' +
                'Підійму в небо я свій зір D A\n' +
                'І там надія моя!\n' +
                '\n' +
                'D F#m G A\n' +
                'Я не здамся, не страшні всі ці бурі\n' +
                'D F#m G A\n' +
                '\n' +
                'Бог зі мною , Йому я довіряю\n' +
                'D F#m G A D\n' +
                '\n' +
                'Все життя моє, життя моє в Його руках! F#m G A ( D - F#m7/C# - G7 /H - A )\n' +
                '\n' +
                'Тримає Він, тримає Він і сильний я!\n' +
                '\n' +
                'Темрява навкруги,\n' +
                'Смертні тіні наді мною повисли\n' +
                'Як цю долину пройти\n' +
                'Щоб не втратити спокій в серці\n' +
                '\n' +
                'Hm F#m/A\n' +
                'З останніх сил,\n' +
                '\n' +
                'А G Hm\n' +
                'Підійму в небо я свій зір D A\n' +
                'І там надія моя!\n' +
                '\n' +
                'D F#m G A\n' +
                'Я не здамся, не страшні всі ці бурі\n' +
                'D F#m G A\n' +
                '\n' +
                'Бог зі мною , Йому я довіряю\n' +
                'D F#m G A\n' +
                '\n' +
                'Все життя моє, життя моє в Його руках!\n' +
                'D F#m G A\n' +
                '\n' +
                'Тримає Він, тримає Він і сильний я!\n' +
                '\n' +
                'Bridge\n' +
                'Hm D G A \n' +
                '\n' +
                'Мій Бог Ти прийдеш, коли я кличу Тебе-\n' +
                '"Дай руку мені, мене підніми"\n' +
                'І навіть тоді, коли відвернуться всі\n' +
                'На Себе візьмеш безсилля моє\n' +
                '\n' +
                'Ти завжди спішиш коли я впаду,\n' +
                'Подати мені руку Свою\n' +
                'І скільки б разів не впав\n' +
                'Ти підіймав!');
        }
        else if (messageText === "прекрасний ти" || messageText === "в світанках всіх" || messageText === "у світлі місяця")
        {
            bot.sendMessage(id, 'E  Asus2  C#m7  Hsus\n' +
                'В світанках всіх Твоє лице бачу я\n' +
                'В очах Твоїх ранкових кольорів краса\n' +
                'Світ просинається у променях дня\n' +
                'До неба лине пісня ця\n' +
                'Прекрасний Ти\n' +
                '\n' +
                'У світлі місяця знов сила Твоя\n' +
                'Планети і галактики яскраві бачу я\n' +
                'І світлом зорі дивують нас всіх\n' +
                'Усе навколо свідчить, Хто Ти\n' +
                'Прекрасний Ти\n' +
                '\n' +
                'І на хресті Ти висів, і нас спас\n' +
                'В крові весь був, помер і знов воскрес Ісус для нас\n' +
                'Тепер сидиш Ти там на троні небес\n' +
                'Скоро ми побачим Тебе\n' +
                'Прекрасний Ти\n' +
                '\n' +
                'На берег вічності народ Твій прийде\n' +
                'Де смерть -- це лише спогади, і сльози -- пусте\n' +
                'Весільні дзвони пролунають в той час\n' +
                'І пісню наречена здійме\n' +
                'Прекрасний Ти\n');

        }
        else if (messageText === "як олень прагне" || messageText === "як олень прагне до потоків" || messageText === "ти один моє серце знаєш")
        {
            bot.sendMessage(id, '1 куплет:\n' +
                'C     G         Am   Am/G \n' +
                'Як олень прагне до потоків,\n' +
                'F         G      C   G \n' +
                'Так душа моя прагне Тебе,\n' +
                'C      G     Am     Am/G \n' +
                'Я бажаю Тобі сказати,\n' +
                'F         G         C \n' +
                'Що я так люблю Тебе.\n' +
                '\n' +
                ' Am  Am/G     F      C \n' +
                ' Ти один моє серце знаєш,\n' +
                ' F          Dm         E \n' +
                ' І в нього Ти любов вливаєш,\n' +
                ' C     G    Am    Am/G \n' +
                ' Я бажаю Тобі сказати,\n' +
                ' F       G       C \n' +
                ' Що я так люблю Тебе.\n' +
                '\n' +
                '2 куплет:\n' +
                'Простягнув Ти пробиті руки\n' +
                'І від смерті мене врятував\n' +
                'Щоб мене захистить від муки\n' +
                'На хресті Ти кров пролляв.\n' +
                '\n' +
                ' Не зрівняти с Тобою злато,\n' +
                ' Тільки Ти щастя нам даєш.\n' +
                ' І в недолі допомогаєш,\n' +
                ' І сіяння нам несеш.\n' +
                '\n' +
                '3 куплет:\n' +
                'Щирим серцем Тебе я кохаю,\n' +
                'Бо життя дарував Ти мені.\n' +
                'За Твою доброту і ласку\n' +
                'Дуже вдячний я тобі.\n' +
                '\n' +
                ' Ти - мій Друг, Ти - мій Брат надійний,\n' +
                ' Хоч Ти є і моїм Царем.\n' +
                ' Люблю Тебе, як нікого більше,\n' +
                ' І піснями славлю Тебе.\n' +
                '\n' +
                '4 куплет:\n' +
                'Як лелека моря долає\n' +
                'Чує здалеку шелест гнізда.\n' +
                'Так душа моя спрагла знає,\n' +
                'Де для неї жива вода\n' +
                '\n' +
                ' Ти мій приятель, брат мій любий,\n' +
                ' Справедливий цар є Ти.\n' +
                ' Ти моя любов єдина,\n' +
                ' Я з Тобою хочу йти.\n' +
                '\n' +
                '5 куплет:\n' +
                'Ти єдиний даруєш радість,\n' +
                'Ти для мене є усе,\n' +
                'Ти єдина моя надія,\n' +
                'Найдорожчий понад все.\n' +
                '\n' +
                ' За багатства земні дорожчий\n' +
                ' Той, Хто спокій мені дарував.\n' +
                ' Радість маю в Тобі, мій Боже,\n' +
                ' Лиш в Тобі життя вповні.\n' +
                '------------------------------\n' +
                'Исполнитель: Пісні хвали\n' +
                'Название песни: Як олень прагне до потоків\n');

        }
        else if (messageText === "благослови душа моя господа" || messageText === "жертвой иисуса Христа я спасён от огня" || messageText === "я верю в голгофскую жертву")
        {
            bot.sendMessage(id, 'D  A  Hm  G \n' +
                '\n' +
                'Куплет: \n' +
                'D       A       Hm             G \n' +
                'Жертвой Иисуса Христа я спасён от огня, \n' +
                'D             A        Hm       G \n' +
                'Ранами Иисуса Христа я исцелён - нет сомнения. \n' +
                'D         A       Hm               G \n' +
                'Кровью Иисуса Христа я омыт от греха, \n' +
                'D         A            Hm            G \n' +
                'Через смерть Иисуса Христа мне дана жизнь вечная. \n' +
                '\n' +
                'Припев: \n' +
                '  D     A              Hm     G \n' +
                'Благослови душа моя, Господа, \n' +
                ' D        A              Hm     G \n' +
                'И вся внутренность моя святое имя Его! \n' +
                ' D        A              Hm     G \n' +
                'Благослови душа моя, Господа, \n' +
                'D         A         Hm     G \n' +
                'И не забывай всех благодеяний Его! \n' +
                '\n' +
                'Мост: \n' +
                '  D        A             Hm               G \n' +
                'Я верю в Голгофскую жертву, Кровь святую Твою, жизнь вечную. \n' +
                'D             A           Hm        G \n' +
                'В то, что имя мое записано на небесах. Я верю...\n' +
                '\n' +
                ' D             C             G/H              G\n' +
                'На небесах... На небесах... На небесах... На небесах...\n' +
                ' D         C            G/H                   G\n' +
                'На небесах... На небесах... На небесах... На небесах... \n' +
                ' D\n' +
                'На небесах...\n' +
                '------------------------------\n' +
                'Исполнитель: Новое Поколение церковь г. Рига\n' +
                'Название песни: Благослови душа моя Господа\n');

        }
        else if (messageText === "ты ждешь когда я прийду к тебе такой как есть" || messageText === "ты ждешь когда я прийду" || messageText === "ты ждешь когда я прийду к тебе" || messageText === "как велика твоя любовь")
        {
            bot.sendMessage(id, 'C#m   A             E   F#m\n' +
                'Ты ждешь когда я приду к Тебе такой как есть\n' +
                'C#m     A             E               F#m\n' +
                'Ты ждешь когда я приду к Тебе такой как есть\n' +
                '\n' +
                'C#m          A         E        F#m\n' +
                'Печать Твоей любви в сердце моем навеки, навсегда\n' +
                'C#m           A                   E     F#m \n' +
                'Как велика Твоя любовь ревность как летящая стрела\n' +
                'C#m              A         E                        F#m\n' +
                'Ничто не в силах угасить Твою любовь\n' +
                '\n' +
                'C#m            A           E         F#m \n' +
                'Приди огнем Своим Господь сожги мой грех, омой меня\n' +
                'C#m           A          E         F#m\n' +
                'Приди огнем Своим Господь и будем вместе Ты и я\n' +
                '\n' +
                'C#m                      A  \n' +
                'Больше не хочу говорить я и в ночной темноте\n' +
                'E                          F#m  \n' +
                'Лишь смотреть на Тебя хочу только петь Тебе\n' +
                '\n' +
                'C#m          A           E       F#m  \n' +
                'Аллилуйя, аллилуйя, и будем вместе Ты и я\n' +
                'C#m         A       E               F#m  \n' +
                'Аллилуйя, аллилуйя, и будем вместе...\n' +
                '\n' +
                'C#m                            A  \n' +
                'Господь, мы хотим ещё, Господь, мы хотим ещё,\n' +
                'E                               F#m  \n' +
                'Господь, мы хотим ещё больше славы...\n' +
                '------------------------------\n' +
                'Исполнитель: Виталий Ефремочкин\n' +
                'Название песни: Ты ждешь когда я приду к Тебе\n');

        }
        else if (messageText === "моя молитва нехай лине" || messageText === "боже, я молюсь за україну" || messageText === "боже я молюсь за україну")
        {
            bot.sendMessage(id, 'Em             C\n' +
                '  Моя молитва нехай лине\n' +
                'Am         Hm       Em\n' +
                '  До Тебе, наче фіміам,\n' +
                'Em                  C\n' +
                '  І серце лине безупинно\n' +
                'Am          Hm            Em \n' +
                '  В чудовий Твій небесний храм.\n' +
                '\n' +
                '\n' +
                '          G           D\n' +
                'Боже, я молюсь за Україну,\n' +
                '        Em           H7\n' +
                'Боже, молю Тебе за людей.\n' +
                '          C            D\n' +
                'Ти їх прости, Ти їх спаси\n' +
                '  H7                Em\n' +
                'І милість Свою нам яви.\n' +
                '         G                  D\n' +
                'Боже, я знаю, що Ти будеш з нами\n' +
                '           Em          H7\n' +
                'В храмі Твоєму під небесами.\n' +
                '          C          D \n' +
                'Радість і мир Ти дарував,\n' +
                '   H7             Em\n' +
                'Життя за людей віддав,\n' +
                '        D  C          H7 \n' +
                'В Книгу Життя нас записав!\n' +
                '\n' +
                '\n' +
                '\n' +
                'В Своєму Слові Живому\n' +
                'Ти для життя веління дав,\n' +
                'Щоб люди всі молились Тому,\n' +
                'Хто на хресті за них вмирав.\n' +
                '------------------------------\n' +
                'Исполнитель: Рема\n' +
                'Название песни: Моя молитва нехай лине\n');

        }
        else if (messageText === "славь душа господа" || messageText === "пой ему как никогда" || messageText === "cолнце встаёт новый день приходит")
        {
            bot.sendMessage(id, 'Припев:\n' +
                ' C               G      D/F#       Em \n' +
                'Славь, душа, Господа, Славь, душа, \n' +
                'C          G   Dsus4  D \n' +
                'Имя Святое Его. \n' +
                ' C           Em    C       D  Em \n' +
                'Пой Ему, как никогда, пой, душа, \n' +
                'C        D           C/G   G   C/G   G \n' +
                'Благослови Господа. \n' +
                '\n' +
                '1 Куплет:\n' +
                '  C         G          D           Em \n' +
                'Солнце встаёт, новый день приходит, \n' +
                'C         G              D       Em \n' +
                'Время опять хвалу воздать \n' +
                ' C         G          D          Em \n' +
                'За всё, что Ты мне дал, и за каждый новый вдох мой \n' +
                'C2       G        Dsus4  D    G   Gsus4   G \n' +
                'Я буду петь и на закате дня. \n' +
                '\n' +
                '2 Куплет:\n' +
                'Велик в любви, и даёшь мне милость, \n' +
                'Ты справедлив и так благ ко мне, \n' +
                'За все Твои дела я хочу прославить \n' +
                'Чтоб петь Тебе, есть 10 тысяч причин. \n' +
                '\n' +
                '3 Куплет:\n' +
                'И когда мои силы иссякнут \n' +
                'На закате дней, когда время придёт, \n' +
                'Душа моя Тебя да будет славить \n' +
                'Больше, чем даже 10 тысяч лет.\n' +
                '------------------------------\n' +
                'Исполнитель: Слово Жизни Youth\n' +
                'Название песни: Славь душа Господа\n');

        }
        else if (messageText === "твоя любов,немов ріка" || messageText === "про твою любов співаю" || messageText === "твоя любов немов ріка"|| messageText === "твоя любов")
        {
            bot.sendMessage(id, 'Куплет:\n' +
                'E                          F#m\n' +
                'Твоя любов, немов ріка, як височінь могутніх гір,\n' +
                'A                          H\n' +
                'Здійму до Тебе я свій зір і заспіваю Тобі.\n' +
                'E                                             F#m\n' +
                'До мого серця доторкнись, відчути хочу цю любов,\n' +
                'A                                               H\n' +
                'Нехай Твій Дух Святий зійде й наповнить серце знов.\n' +
                '\n' +
                'Припев:\n' +
                ' E             F#m\n' +
                ' Про Твою любов співаю,\n' +
                ' A                   H\n' +
                ' Хай мій спів звідусіль лунає,\n' +
                ' E                          F#m\n' +
                ' Кожне серце нехай пізнає,\n' +
                ' A                  H     \n' +
                '------------------------------\n' +
                'Исполнитель: Голгофа церква м.Київ\n' +
                'Название песни: Твоя любов немов ріка\n');

        }
        else if (messageText === "когда умолкнет звук" || messageText === "когда умолкнет звук и музыка уйдёт" || messageText === "господь всем сердцем я поклоняюсь")
        {
            bot.sendMessage(id, 'D        A     Em \n' +
                'Когда умолкнет звук и музыка уйдёт,\n' +
                '   A \n' +
                'Я к Тебе приду.\n' +
                ' D           A          Em \n' +
                'Всей душой моей благословить хочу,\n' +
                '    A \n' +
                'Вознести хвалу.\n' +
                '\n' +
                'Em      D       A         Em \n' +
                'Тебе я песню спою, но не просто слова, -\n' +
                '    D         A \n' +
                'Мой Бог, Ты большего ждёшь.\n' +
                'Em      D         A \n' +
                'Ведь к сокровенным мечтам\n' +
                '      Em \n' +
                'Проникает Твой взгляд,\n' +
                '     D       A \n' +
                'Ты видишь сердце моё.\n' +
                '\n' +
                '  D             A \n' +
                '  Господь всем сердцем я поклоняюсь,\n' +
                '  Em          G          A     D \n' +
                '  Смысл жизни моей только в Тебе, Иисус.\n' +
                '  Прости, что часто я забываю -\n' +
                '  Смысл жизни моей только в Тебе, Иисус.\n' +
                '\n' +
                'Ты великий Царь, не выразить в словах,\n' +
                'Как высок Твой трон.\n' +
                'Даже если я беден и слаб,\n' +
                'Ты всегда со мной.\n');

        }
        else if (messageText === "божий дизайн" || messageText === "в дизайне божьем" || messageText === "так красок много в дизайне Бога")
        {
            bot.sendMessage(id, '   Dm       F       G     Am\n' +
                'В дизайне Божьем нету заблуждения и ошибок нет.\n' +
                'Dm          F         G      Am\n' +
                'Все продумано тонко: цвет волос и кожи цвет.\n' +
                '     F   C   Dm         Am\n' +
                'И там    радость и свет\n' +
                ' Dm            Am      Em    F           G  \n' +
                'Нет голодных и бедных, нет больных, и слабых нет\n' +
                '\n' +
                '| Am  G  F | F  C | F  Am  G  Em  | Am |\n' +
                '\n' +
                '    Dm               F\n' +
                'В дизайне Божьем нету одиночества\n' +
                '   G               Am\n' +
                'Нет ненужных там.\n' +
                ' Dm    F       G               Am\n' +
                'Никогда там не плачут от бессилия по ночам.\n' +
                '    F   C  Dm      Am\n' +
                'Там всех      любят и ждут.\n' +
                ' Dm           Am     Em      F       G    Am  \n' +
                'Не солгут, не изменят, и друзей не предадут\n' +
                '\n' +
                'Припев:\n' +
                '   C    Dm         C  Dm\n' +
                'Так красок много в дизайне Бога\n' +
                'Am             Em           Dm    G\n' +
                'Там нету боли, нету слёз и одиночества\n' +
                '   C       Dm     C  Dm\n' +
                'Там много света и лишних нет там\n' +
                'Am         Em            Dm     G  \n' +
                'Там для тебя найдётся место если хочешь ты\n' +
                '\n' +
                '| Am  G |\n' +
                '\n' +
                '          Dm               F\n' +
                'В дизайне Божьем место есть для каждого\n' +
                'G                      Am\n' +
                'Очень ценен ты\n' +
                '  Dm         F          G           Am\n' +
                'Человек - это Божье воплощение красоты\n' +
                '             F  C  Dm          Am\n' +
                'Ведь ты -    тот, для кого\n' +
                ' Dm       Am  Em      F   G    Am   G\n' +
                'Бог отдал на распятие Сына Своего\n' +
                '------------------------------\n' +
                'Исполнитель: Новый Иерусалим\n' +
                'Название песни: Божий дизайн\n');

        }
        else
        {
            bot.sendMessage(id, 'Введіть, будь ласка:\n' +
                '- перший рядок пісні;\n' +
                '- перший рядок приспіву;\n' +
                '- назву пісні.\n')
        }
    }
);

