'use strict';

const TelegramBot = require('node-telegram-bot-api'),
      request     = require('request'),
      fs          = require('fs'),
      token       = '580283341:AAF0oqkdMEX6zPgjaNNQJdOS7DPYREzddes',
      bot         = new TelegramBot(token, {polling: true});

bot.on('message', function (msg)
    {
        const id           = msg.from.id,
              _messageText = msg.text,
              massageText  = _messageText.toLocaleLowerCase();


        if (massageText === "привет")
        {
            bot.sendMessage(id, 'Вступ: D - F#m7/C# - G7 /H - A\n' +
                'D F#m7/C# \n' +
                'Серед моря один,\n' +
                '\n' +
                'Hm A \n' +
                'Буря човен перевертає\n' +
                'D F#m7/C#\n' +
                '\n' +
                'Втриматись нема сил,\n' +
                '\n' +
                'Hm A \n' +
                'Ця стихія життя поглинає…\n' +
                '\n' +
                'Hm F#m/A\n' +
                'З останніх сил,\n' +
                '\n' +
                'А G Hm\n' +
                'Підійму в небо я свій зір D A\n' +
                'І там надія моя!\n' +
                '\n' +
                'D F#m G A\n' +
                'Я не здамся, не страшні всі ці бурі\n' +
                'D F#m G A\n' +
                '\n' +
                'Бог зі мною , Йому я довіряю\n' +
                'D F#m G A D\n' +
                '\n' +
                'Все життя моє, життя моє в Його руках! F#m G A ( D - F#m7/C# - G7 /H - A )\n' +
                '\n' +
                'Тримає Він, тримає Він і сильний я!\n' +
                '\n' +
                'Темрява навкруги,\n' +
                'Смертні тіні наді мною повисли\n' +
                'Як цю долину пройти\n' +
                'Щоб не втратити спокій в серці\n' +
                '\n' +
                'Hm F#m/A\n' +
                'З останніх сил,\n' +
                '\n' +
                'А G Hm\n' +
                'Підійму в небо я свій зір D A\n' +
                'І там надія моя!\n' +
                '\n' +
                'D F#m G A\n' +
                'Я не здамся, не страшні всі ці бурі\n' +
                'D F#m G A\n' +
                '\n' +
                'Бог зі мною , Йому я довіряю\n' +
                'D F#m G A\n' +
                '\n' +
                'Все життя моє, життя моє в Його руках!\n' +
                'D F#m G A\n' +
                '\n' +
                'Тримає Він, тримає Він і сильний я!\n' +
                '\n' +
                'Bridge\n' +
                'Hm D G A \n' +
                '\n' +
                'Мій Бог Ти прийдеш, коли я кличу Тебе-\n' +
                '"Дай руку мені, мене підніми"\n' +
                'І навіть тоді, коли відвернуться всі\n' +
                'На Себе візьмеш безсилля моє\n' +
                '\n' +
                'Ти завжди спішиш коли я впаду,\n' +
                'Подати мені руку Свою\n' +
                'І скільки б разів не впав\n' +
                'Ти підіймав!');
        }
        else if (massageText === "пока")
        {
            bot.sendMessage(id, 'E  Asus2  C#m7  Hsus\n' +
                'В світанках всіх Твоє лице бачу я\n' +
                'В очах Твоїх ранкових кольорів краса\n' +
                'Світ просинається у променях дня\n' +
                'До неба лине пісня ця\n' +
                'Прекрасний Ти\n' +
                '\n' +
                'У світлі місяця знов сила Твоя\n' +
                'Планети і галактики яскраві бачу я\n' +
                'І світлом зорі дивують нас всіх\n' +
                'Усе навколо свідчить, Хто Ти\n' +
                'Прекрасний Ти\n' +
                '\n' +
                'І на хресті Ти висів, і нас спас\n' +
                'В крові весь був, помер і знов воскрес Ісус для нас\n' +
                'Тепер сидиш Ти там на троні небес\n' +
                'Скоро ми побачим Тебе\n' +
                'Прекрасний Ти\n' +
                '\n' +
                'На берег вічності народ Твій прийде\n' +
                'Де смерть -- це лише спогади, і сльози -- пусте\n' +
                'Весільні дзвони пролунають в той час\n' +
                'І пісню наречена здійме\n' +
                'Прекрасний Ти\n');

        }
        else
        {
            bot.sendMessage(id, 'Введіть ваш запит, будь ласка, ще раз')
        }
    }
);